frontend/models/SignupForm.php

INSERT INTO `user` (`username`, `email`, `password_hash`, `auth_key`, `status`, `created_at`, `updated_at`) VALUES ('admin', 'anami.samdo@gmail.com', '$2y$13$5lLNpoa4qHdRU2kIBaWgDOrsRKqwy0e8/qr.EWiDoeupOdE81ll.K', 'CIJc_IXqdZp0oa7-OtxNIH66rRUXM_YN', 10, 1532430934, 1532430934)
---
    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        $user->username = $this->username;
        $user->email = $this->email;
        $user->setPassword($this->password);
        $user->generateAuthKey();

        return $user->save() ? $user : null;